openFOAM/karmanVortexStreet/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    out
    {
        type            patch;
        nFaces          80;
        startFace       50780;
    }
    sym1
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          260;
        startFace       50860;
    }
    sym2
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          260;
        startFace       51120;
    }
    in
    {
        type            patch;
        nFaces          80;
        startFace       51380;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          160;
        startFace       51460;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          25600;
        startFace       51620;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          25600;
        startFace       77220;
    }
)

// ************************************************************************* //
